Revit 2026 API

# StairsGetStairsRuns Method

---

Returns all the stairs run components in the stairs.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> GetStairsRuns()
```
```vb
Public Function GetStairsRuns As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ GetStairsRuns()
```
```fsharp
member GetStairsRuns : unit -> ICollection<ElementId>
```

#### Return Value

ICollectionElementId The stairs run components in the stairs.

#### Reference

Stairs Class

Autodesk.Revit.DB.Architecture Namespace